eisup_2019_docmng_integration/src/InformationRegisters/абс_ИсторияСтатусовАСБ/абс_ИсторияСтатусовАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИсторияСтатусовАСБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыАСБ</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектСогласования</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
      <types>CatalogRef.Валюты</types>
      <types>DocumentRef.абс_ВыгрузкаАСБ</types>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      <types>CatalogRef.абс_ПравилаСбораДанныхАСБ</types>
      <types>DocumentRef.абс_ЗагрузкаАСБ</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыАСБ/абс_СтатусыАСБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыАСБ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Заполнение</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеВыгрузки</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/CommonModules/абс_ИнтеграцияАСБКлиент/Module.bsl
Процедура ОткрытьИсториюСтатусов(Ссылка) Экспорт
	
	ЗначениеОтбора = Новый Структура("ОбъектСогласования", Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.абс_ИсторияСтатусовАСБ.ФормаСписка", СтруктураПараметров);

КонецПроцедуры

Процедура ЗаполнитьСписокДоступныхСтатусов(ЭтаФорма, ЭтотОбъект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.абс_Статус) Тогда
		ТекущаяМодицированность = ЭтаФорма.Модифицированность;  
		ЭтотОбъект.абс_Статус = Перечисления.абс_СтатусыАСБ.Активный;
		Если НЕ ТекущаяМодицированность Тогда 
			ЭтаФорма.Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекущийСтатус", ЭтотОбъект.абс_Статус);
	
	МассивСтатусов = РегистрыСведений.абс_ИсторияСтатусовАСБ.ПолучитьСписокДоступныхСтатусов(СтруктураПараметров);
	ЭтаФорма.ЭлементыФормы.абс_Статус.СписокВыбора.ЗагрузитьЗначения(МассивСтатусов);
	
КонецПроцедуры

Процедура УстановитьВидимостьПоСтатусам(ЭтаФорма, ЭтотОбъект) Экспорт
	
	ЭтоУпрФорма = ТипЗнч(ЭтаФорма) = Тип("УправляемаяФорма");
	РедактированиеРазрешено = (ЭтотОбъект.абс_Статус = Перечисления.абс_СтатусыАСБ.Корректировка) 
						  		ИЛИ (ЭтотОбъект.абс_Статус = Перечисления.абс_СтатусыАСБ.Подготовка); 
								
	Если ЭтоУпрФорма Тогда 
		Элементы = ЭтаФорма.Элементы;
	Иначе
		Элементы = ЭтаФорма.ЭлементыФормы; 	
	КонецЕсли;
								
	Для Каждого Элемент Из Элементы Цикл
		Если Элемент.Имя    = "абс_Статус" 
			или ТипЗнч(Элемент) = Тип("Надпись") 
			или ТипЗнч(Элемент) = Тип("Панель") 
			или Элемент.Имя    = "ДействияФормы"  
			или Элемент.Имя    = "ОсновныеДействияФормы" 
			или ТипЗнч(Элемент) = Тип("РамкаГруппы") 
			или ТипЗнч(Элемент) = Тип("Рамка") 
			ИЛИ ТипЗнч(элемент) = тип("ДекорацияФормы") 	
			ИЛИ ТипЗнч(элемент) = тип("КнопкаКоманднойПанели") 
			ИЛИ ТипЗнч(элемент) = тип("КнопкаФормы")
			ИЛИ ТипЗнч(элемент) = тип("ГруппаФормы")
			ИЛИ ТипЗнч(элемент) = тип("УправляемаяФорма")
			Тогда
			Продолжить;
		КонецЕсли;	      
		
		Если ЭтоУпрФорма Тогда 
			Элемент.ТолькоПросмотр = НЕ РедактированиеРазрешено;	
		Иначе
			Если ТипЗнч(Элемент) = Тип("ПолеВвода") ИЛИ ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда	
				Элемент.ТолькоПросмотр = НЕ РедактированиеРазрешено		
			Иначе	
				Элемент.Доступность = РедактированиеРазрешено;
			КонецЕсли;				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПричинуИзмененияСтатуса(ЭтотОбъект, ПричинаИзмененияСтатуса = Неопределено) Экспорт
	
	ПричинаИзмененияСтатуса = "";
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		СтатусПоРегистру = РегистрыСведений.абс_ИсторияСтатусовАСБ.ПолучитьТекущийСтатус(ЭтотОбъект.Ссылка);
		Если СтатусПоРегистру <> ЭтотОбъект.абс_Статус И ЗначениеЗаполнено(СтатусПоРегистру) Тогда 
			ВвестиСтроку(ПричинаИзмененияСтатуса, "Введите причину изменения статуса",,Истина);
		КонецЕсли;
	Иначе
		ПричинаИзмененияСтатуса = "Ввод нового элемента";	
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект) <> Тип("ДанныеФормыСтруктура") Тогда 
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ПричинаИзмененияСтатуса", ПричинаИзмененияСтатуса);
	КонецЕсли;
	
КонецПроцедуры
